---
title: "Этап 3: Программная реализация и численные методы"

date: "2026-04-12"

authors:
  - Шубина-София-Антоновна
  - Михайлова-Регина-Алексеевна
  - Андреева-Софья-Владимировна

event: "Групповой проект. Этап 3"
event_url: ""

location: "РУДН"
address:
  city: Москва
  country: Россия

summary: "Третий этап проекта посвящён выбору языка программирования, структуре модулей, реализации численных методов решения уравнений теплопроводности и детерминированного горения, а также вводу/выводу данных и визуализации."

abstract: "На третьем этапе разработана программная реализация проекта. Выбраны языки Julia и Python. Реализованы явные и неявные разностные схемы для одномерного уравнения теплопроводности с учётом тепловыделения от химической реакции. Созданы модули для численного интегрирования, визуализации (matplotlib, Plots.jl) и работы с входными/выходными данными (CSV, текстовые файлы). Проведено тестирование на различных наборах параметров, включая влияние энергии активации E."

tags:
  - Программная реализация
  - Численные методы
  - Julia
  - Python
  - Теплопроводность
  - Детерминированное горение
  - Визуализация

featured: true
---

### Что делали на этом этапе?

На третьем этапе выполнена программная реализация проекта:
- Описали программную реализацию проекта.
- Выбраны языки программирования **Julia** и **Python**.
- Разработана модульная структура кода.
- Реализованы численные методы решения одномерного уравнения теплопроводности с источником тепла от химической реакции.
- Созданы модули ввода/вывода данных и визуализации.
- Проведено тестирование программы на различных наборах входных параметров.

### Структура программы

Программа структурирована в виде набора модулей, каждый из которых реализует определенные части алгоритмов:

1. **Модуль уравнений теплопроводности и горения**
   - Реализация численных методов для решения одномерной системы уравнений, описывающих процессы теплопроводности и горения.
   - Использование явных или неявных методов конечных разностей для численного интегрирования уравнений.

2. **Модуль визуализации результатов**
   - Визуализация процессов теплопроводности и горения с использованием библиотеки Matplotlib (Python) и Plots.jl (Julia).
   - Создание графиков распределения температуры и концентрации продуктов горения в пространстве и времени.

3. **Модуль ввода/вывода данных**
   - Входные данные представлены в виде файлов, содержащих начальные условия, параметры системы.
   - Результаты сохраняются в файлы формата CSV или изображения графиков для последующего анализа и визуализации.

### Тестирование программы

- Проведение систематического тестирования программы на различных наборах входных данных.
- Использование отладчика Python для выявления и устранения ошибок в программном коде.
- Проверка устойчивости явной схемы (условие \( \chi \Delta t / h^2 \leq 0.5 \)).

### Пример реализации на Julia

```julia
function calculate_temperature(N, t_end, L, lambda, ro, c, kapa, Te, q, k8, E, T0)
    h = L / N
    tau = t_end / 100  # шаг по времени
    T = fill(T0, N+1)
    # ... численное интегрирование
    return T
end

# Вводим параметры
kapa = 40
Te = 243
q = 1000
k8 = 30000
E = 36500
N = 1000
t_end = 1000
L = 0.2
Lambda = 0.7
ro = 1500
c = 750
T0 = 298

# Рассчитываем температурное поле
temperature_field = calculate_temperature(N, t_end, L, lambda, ro, c, kapa, Te, q, k8, E, T0)

# Выводим результаты в файл
open("res.txt", "w") do f
    @printf(f, "Толщина пластины L = %.4f\n", L)
    @printf(f, "Число узлов по координате N = %d\n", N)
    @printf(f, "Коэффициент теплопроводности Lambda = %.4f\n", Lambda)
    @printf(f, "Температурное поле в момент времени t = %.4f\n", t_end)
end

# Визуализация результатов
using Plots
plot(temperature_field, xlabel="Координата", ylabel="Температура", title="Температурное поле")

```

### Критические значения

В ходе численных экспериментов установлено, что E = 36600 является критическим значением энергии активации, при котором происходит смена режима горения.

### Результаты 3 этапа

Для реализации проекта выбран язык программирования Julia и Python.

Данные структурированы в виде набора модулей, каждый из которых реализует определенные части алгоритмов.

Входные данные представлены в виде файлов с необходимыми данными.

Вывод осуществляется в файлы формата CSV и/или графиков.

Проведено тестирование программы.

### Источники
Моделирование физических процессов и явлений на ПК / Д. А. Медведев, А. Л. Куперштох, Э. Р. Прууэл [и др.]. – Новосибирск : Новосиб. гос. ун-т, 2010. – 101 с. – ISBN 978-5-94356-933-3.